SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/QH4JE43MDC/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId></eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken></sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2018-12-07T17:55" ArrivalDateTime="2018-12-08T04:50" FlightNumber="214" NumberInParty="1" ResBookDesigCode="N" Status="NN">      <DestinationLocation   LocationCode="KEF"/>      <Equipment AirEquipType="321"/>      <MarketingAirline Code="WW" FlightNumber="214"/>      <OperatingAirline Code="WW"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-12-08T11:45" ArrivalDateTime="2018-12-09T03:15" FlightNumber="322" NumberInParty="1" ResBookDesigCode="N" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="330"/>      <MarketingAirline Code="WW" FlightNumber="322"/>      <OperatingAirline Code="WW"/>      <OriginLocation   LocationCode="KEF"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-12-21T07:00" ArrivalDateTime="2018-12-21T13:20" FlightNumber="323" NumberInParty="1" ResBookDesigCode="L" Status="NN">      <DestinationLocation   LocationCode="KEF"/>      <Equipment AirEquipType="330"/>      <MarketingAirline Code="WW" FlightNumber="323"/>      <OperatingAirline Code="WW"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-12-21T15:30" ArrivalDateTime="2018-12-21T16:25" FlightNumber="213" NumberInParty="1" ResBookDesigCode="L" Status="NN">      <DestinationLocation   LocationCode="YYZ"/>      <Equipment AirEquipType="321"/>      <MarketingAirline Code="WW" FlightNumber="213"/>      <OperatingAirline Code="WW"/>      <OriginLocation   LocationCode="KEF"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>